Infineon/IMR_PSoC6_BMS/proj_cm4/Libraries/BMS_Functionalities/global_management.h
/*
 * global_management.h
 * 		Abstraction off all settings and objects that can be accessed
 * 		from every part of the system.
 *
 *  Created on: 1 Jun 2023
 *      Author: r. santeler
 *
*******************************************************************************
 * (c) (2024), Cypress Semiconductor Corporation (an Infineon company) or
 * an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
 * This software, including source code, documentation and related
 * materials ("Software") is owned by Cypress Semiconductor Corporation
 * or one of its affiliates ("Cypress") and is protected by and subject to
 * worldwide patent protection (United States and foreign),
 * United States copyright laws and international treaty provisions.
 * Therefore, you may use this Software only as provided in the license
 * agreement accompanying the software package from which you
 * obtained this Software ("EULA").
 * If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
 * non-transferable license to copy, modify, and compile the Software
 * source code solely for use in connection with Cypress's
 * integrated circuit products.  Any reproduction, modification, translation,
 * compilation, or representation of this Software except as specified
 * above is prohibited without the express written permission of Cypress.
 *
 * Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
 * reserves the right to make changes to the Software without notice. Cypress
 * does not assume any liability arising out of the application or use of the
 * Software or any product or circuit described in the Software. Cypress does
 * not authorize its products for use in any products where a malfunction or
 * failure of the Cypress product may reasonably be expected to result in
 * significant property damage, injury or death ("High Risk Product").
 * By including Cypress's product in a High Risk Product, the manufacturer
 * of such system or application assumes all risk of such use and in doing so
 * agrees to indemnify Cypress against all liability.
*******************************************************************************/

#ifndef GLOBAL_MANAGEMENT_H_
#define GLOBAL_MANAGEMENT_H_

#include "cycfg.h"
#include "cy_pdl.h"
#include "cyhal.h"
#include "cybsp.h"
#include "cy_retarget_io.h"

#include "ram_public.h"
#include "safety_switch.h"
#include "BMS_TLE9012/BMS_TLE9012.h"
#include "battery_state.h"


/*******************************************************************************
* Debug message definitions
* Un/comment the printf commands to show or hide certain messages
*******************************************************************************/
#define PRINTF_CYCLIC_DEBUG_MSGS(p_frm, ...)	printf(p_frm, ##__VA_ARGS__)

//****************************************************************************
//           SETTING DEFINITIONS
//****************************************************************************
#define EXT_DATALOG_ENABLED	0
// System constants
#define NUM_CELLS 12

// LED control
#define BLINK_TIME_LED_ORANGE 			300	// Time in ms between each blink of
											// the orange LED during precharge
#define BLINK_TIME_LED_RED 				750	// Time in ms between each blink of
											// the red LED when system charge state
											// is below warning threshold
#define BLINK_TIME_LED_RED_ON_TIME		50	// Time in ms that the red LED stays on
											// while blinking on BLINK_TIME_LED_RED interval
#define BLINK_TIME_LED_GREEN_SHUTDOWN	200	// Time in ms between each blink of
											// the green LED during shutdown

// Coding resister - slot detection
#define CODING_RES_MAINBOARD_2_BELOW_mV	2578	// The voltage threshold when the system is
												// inside the IMR mainboard 2 with the
												// 13 KOhm resistor installed (part of
												// a voltage divider measured by internal ADC)
#define CODING_RES_MAINBOARD_1_BELOW_mV	1800	// The voltage threshold when the system is
												// inside the IMR mainboard 1 with the
												// 7.5 KOhm resistor installed (part of
												// a voltage divider measured by internal ADC)
#define CODING_RES_CHARGER_BELOW_mV		705		// The voltage threshold when the system is
												// in the charger with 0 Ohm installed
												// as coding resistor
#define SLOT_PLUG_DEBOUNCE_TIME			1000	// Time in ms that must pass before
												// slot state changes to a state where
												// switch on is possible are accepted.
												// Prevents switch on during plug in etc
#define DETECT_SLOT_BASED_ON_CURRENT    0		// EXPERIMENTAL: Determine slot based on
												// current and coding resistor
												// (1, experimental/untested) or only based on
												// coding resistor (0, default).
												// Can be used for lab cycling

// Main loop task intervals
#define CAN_MINIMAL_MESSAGE_TIME		5		// Minimal time between CAN messages to limit
												// bus usage. Also defines how fast recorded
												// real time (RT) data can be transfered via
												// CAN command BMS_RT_Data_GetLines
												// (e.g. 3275 lines with 2 messages per line
												// and 5ms between messages -> 32.75s)
#define CAN_DATA_REFRESH_TIME			300		// Time between each send of status information
												// via CAN (voltage, current, SoC, ...)
#define CAN_SWICH_ON_VETO_REFRESH_TIME	100		// Time between each send of the switch on veto
												// via CAN. This is needed to signal any other
												// BMS that this BMS is supplying the load and
												// that it should not switch on
#define EXTERNAL_COMMUNICATION_TIME    	1000	// Time in ms that must pass between
												// cyclic debug message sending
#define BALANCING_REFRESH_TIME			5000	// Time in ms that must pass between
												// execution of the balancing algorithm
												// (includes calculation of the cell imbalance,
												// creation of balancing map, and
												// debug message to show cell levels.
												// Does not include send of balancing map
												// to analog front-end)
#define TLE9012_MEASURE_TIME			100		// Time in ms that must pass between
												// 2 main measurement triggers of the TLE9012
												// (analog front-end measuring block/cell
												// voltage, etc). In the same cycle as this
												// the current measurement will be triggered.
												// Do not set this value lower than 2x
												// the minimal ADC refresh time, which is
												// mostly determined by the
												// over-sampling value: MCO3x6x_ADC.h ->
												// CONFIG1_CFG -> OSR_24576
												// (this setting takes around 30ms).
												// 2x because the ADc has 2 channels
#define TLE9012_MEASURE_CHARGE_TIME		250		// Time in ms that must pass between
												// 2 main measurement triggers of the TLE9012
												// while the system is charging. NOTE that
												// the balancing will be disabled at the start
												// of the measurement and will be activated
												// again afterwards (see processMeasurements(),
												// takes around 7ms). Therefore this limits
												// how effective the balancing is.
												// In addition the RoundRobin cycle of
												// the TLE9012 will temporarily deactivate
												// balancing for around ~1ms every 50ms.
#define UPDATE_PUBLIC_DISPLAY_DATA_TIME 10		// Time in ms that must pass between
												// the refresh of the data for the CM0+
												// to be shown on the display. Note that
												// some values might not be transmitted
												// every cycle.
#define LAST_UPDATE_DISPLAY_NUM			500		// Number of times the system waits
												// LAST_UPDATE_DISPLAY_DELAY ms for the last
												// display refresh at shutdown. This times
												// the DELAY must be long enough to update
												// the display at least 2x (mainly limited by
												// display refresh time and
												// CM0_REFRESH_PERIOD_MIN)
												// e.g. 500*9ms = 4500ms
#define LAST_UPDATE_DISPLAY_DELAY		9		// Delay in ms that the system waits between
												// last display refresh tries, after shutdown
												// button is pressed. This times the NUM
												// must be long enough to update the display
												// at least 2x (mainly limited by display
												// refresh time and CM0_REFRESH_PERIOD_MIN)
												// e.g. 500*9ms = 4500ms

// Safety switch control
// Note that the setup of the switch must be adjusted in initSwitchDriver() of safety_switch.c
#define PRECHARGE_MIN_TIME				200		// Minimum time in ms that must pass between
												// turn on of precharge and turn on of main
												// current switch in hotswap MAIN mode
												// (initial switch on)
#define PRECHARGE_MAX_TIME				2000	// Maximum time in ms that can  pass between
												// turn on of precharge and turn on of main
												// current switch in hotswap MAIN mode
												// (initial switch on).
												// At the latest after this time
												// the main path is switched on,
												// if no error occurs
#define PRECHARGE_TARGET_V_CHANGE_RATE	0.01	// V/ms. If the change rate of the output
												// voltage is below this value and the
												// PRECHARGE_MIN_TIME has passed the main path
												// is switched on. To deactivate this
												// make set value to -1
												// (only max time will control precharge time)
#define MOSFET_ON_RETRY_TIME        	4000	// Time in ms that must pass between 2 actual
												// tries to set the MOSFET conducting
#define SAFETY_SWITCH_RETRY_COUNT		1		// Limit number of switch on tries
												// TODO Untested to set this higher than 1.
												// Retrying it by execution of
												// reset_safetySwitchTurnOn() works anyway

// Memory
// Note that the setup (size) of the memory can be adjusted in FRAM_DIRECT_SPI.h
#define MEMORY_SYSTEM_DATA_REFRESH_TIME (1*6*1000)	// Time in ms. Time between checks if
													// system data like settings and status
													// (stored SoC and SoH) must be refreshed
#define MEMORY_RT_DATA_C_DIF_MULTIPLIER (1000.0)	// Value multiplied with the capacity
													// difference dC for float to integer
													// conversion (e.g. 1000.0 preserves
													// 3 floating point digits)
#define MEMORY_RT_DATA_DEF_REFRESH_TIME (5000)	// Time in ms. Default time between last and
												// next real time data line must be stored.
												// Used when MEMORY_RT_DATA_FIX_REFRESH_T = 1
#define MEMORY_RT_DATA_MAX_REFRESH_TIME (65400)	// Time in ms. Maximal time between last and
												// next real time data line must be stored.
												// Note that the time difference is stored
												// as unsigned 2byte - when dynamic
												// sampling time is used
												// (MEMORY_RT_DATA_FIX_REFRESH_T = 0)
												// this must never be higher than its range
												// (~65sec)! On Fixed time this can be set
												// much higher.
#define MEMORY_RT_DATA_MIN_REFRESH_TIME (250)	// Time in ms. Minimal time between last and
												// next real time data line must be stored.
												// If this is set lower than
												// TLE9012_MEASURE_TIME or
												// TLE9012_MEASURE_CHARGE_TIME it will be
												// limited by it because at least one
												// measurement must be between recording lines.
#define MEMORY_RT_DATA_FIX_REFRESH_T	(0)		// Boolean. If set to 0 the time between
												// recording of RT data lines will be
												// calculated based on remaining runtime
												// and remaining size in memory.
												// This makes it possible to record
												// a full charge/discharge cycle even
												// on differing loads, but limits
												// the interval to the size of the
												// time field (~65s).
												// The minimal interval is always limited
												// by measurement speed.
												// If set to 1 the time between recording
												// or RT data lines will be fixed to
												// MEMORY_RT_DATA_DEF_REFRESH_TIME.
												// If this is used the stored time field
												// only stores the time offset from
												// the set time. This way the interval
												// can be much higher.
												// The minimal interval is always limited
												// by measurement speed.

// Hotswap, shutdown and watchdog
#define ENABLE_HARDWARE_WATCHDOG		1		// Disable or enable hardware watchdog
												// with cyhal_wdt_init().
												// Note that this feature is deactivated
												// in HW when a debug probe is attached to
												// the board (see PSoC documentation)
#define ENABLE_SOFTWARE_WATCHDOG		1		// Disable or enable software watchdog.
												// Use this for easier debugging.
#define HARDWARE_WATCHDOG_TIMEOUT		6000	// Time in ms between watchdog checks if
												// controller hanged up.
												// If a main loop cycle takes longer than
												// this or controller enters fault state,
												// the system will be reset hard
												// (no soft reset). Note this must be
												// lower than result of
												// cyhal_wdt_get_max_timeout_ms()
#define SOFTWARE_WATCHDOG_TIMEOUT		500		// Time in ms between watchdog checks if
												// main loop hanged up. If a main loop cycle
												//  takes longer than this, the system
												// will be shut down controlled.
#define MAXIMUM_SHUTDOWN_TIME			6000	// Maximum time that can pass between
												// shutdown button press and hard shutdown.
												// Also determines how long the button
												// must be pressed continuously to trigger
												// hard shutdown. Note that this code
												// also runs on CM0 to make sure
												// a shutdown is possible even if
												// one core stops working.
												// The value for the CM0 core must be set
												// in proc_cm0p/main.c
#define HOTSWAP_INIT_SWITCHON_VETO_TIME 1000	// Time in ms at the beginning where
												//the systems send switch on veto messages
												// in order to detect if another one is
												// present and not switch on simultaneously
#define HOTSWAP_CAN_MSG_DELAY_TIME		10		// Time in ms that limits the CAN message
												// sending of switch on veto during
												// init of hotswap
#define HOTSWAP_WAIT_REDUCE_POWER_TIME	1000	// Time in ms that must pass before hot swap
												// goes on after reduce power command is send
#define HOTSWAP_TIMEOUT_TIME			1500	// Time in ms that must pass before a timeout
												// during the hot swap is recognized and
												// the system is shut down
#define HOTSWAP_TAKER_SHUTDWN_VEXT_TIME 10000	// Time in ms that must pass between system
												// startup and the first check if system is
												// in hotswap TAKER role and external voltage
												// is gone (this will lead to shutdown
												// because system can never take over
												// in this condition).
												// This must be high enough so that
												// the potential giver BMS can enable
												// its output when both systems are started
												// at the same time. To deactivate this
												// feature set value to UINT32_MAX.

// Diagnostic and Error thresholds
#define ACTIVATE_CELL_ERROR_IGNORE		0				// IF THIS IS ACTIVE (1)
														// ALL ERRORS CONCERNING
														// TLE9012_INTERRUPT, ADC_ERR,
														// OL_ERR, CELL_OV, CELL_UV,
														// VBAT_UV ARE IGNORED IN ORDER
														// TO USE A EXTERNAL POWER SUPPLY
														// WITHOUT CELLS AS SOURCE.
														// NEVER ACTIVATE THIS IN PRODUCTION
														// ONLY FOR DEBUGGING.
														// WHEN ACTIVE THE RED LED ON THE
														// CONTROLER BOARD IS PERMANENTLY ON
#define LIMIT_SYS_UNDER_VOLTAGE_mV		(2805*NUM_CELLS)// mV. Under-voltage limit for the
														//whole battery. If the pack voltage
														// goes under this the safety switch
														// will be deactivated
														// (MOSFETs blocking)
#define LIMIT_SYS_OVER_VOLTAGE_mV		(4255*NUM_CELLS)// mV. Over-voltage  limit for the
														//whole battery. If the pack voltage
														// goes over this the safety switch
														// will be deactivated
														// (MOSFETs blocking)
#define LIMIT_CELL_UNDER_VOLTAGE_mV		2800			// mV. Under-voltage limit for each
														// cell. If any cell goes under this
														// the safety switch will be
														// deactivated (MOSFETs blocking)
#define LIMIT_CELL_OVER_VOLTAGE_mV		4250			// mV. Over-voltage  limit for each
														// cell. If any cell goes over this
														// the safety switch will be
														// deactivated (MOSFETs blocking)
#define OVERCURRENT_THRESHOLD_POS_mA	6000.0			// mA. Discharge current threshold
														// over which an error is triggered
#define OVERCURRENT_THRESHOLD_NEG_mA	-2500.0 		// mA. Charge current threshold
														// under which an error is triggered
#define TLE9012_INTERNAL_OVERTEMP_C	100.0 				// Celsius. Internal over-temperature
														// threshold of TLE9012
#define TLE9012_EXTERNAL_OVERTEMP_C	60.0 				// Celsius. Internal over-temperature
														// threshold of TLE9012
#define DEEP_DISCHARGE_PROTECTION_V	(2.75f*NUM_CELLS)	// V. If the system voltage drops
														// below this for
														// DEEP_DISCHARGE_PROTECTION_TIME ms
														// the system is shut down to
														// prevent deep discharge
#define DEEP_DISCHARGE_PROTECTION_TIME	5000			// ms. If the system voltage drops
														// below DEEP_DISCHARGE_PROTECTION_V
														// for the given amount of time
														// the system is shut down to
														// prevent deep discharge
#define CHARGE_FROM_UV_EXT_OFFSET_V		0.2				// V. A under-voltage condition is
														// ignored if the external load
														// voltage + this offset is higher
														// than the system voltage.
														// This is the case before output is
														// ON if a charger is connected or
														// after the output is ON because
														// V load = V system.
														// Note that this must be at least
														// high enough to compensate errors
														// between the two voltage
														// measurements (e.g. when ON
														// V_load = 43.8 and V_system = 43.9
														// due to calibration error)
#define CHARGE_FROM_UV_EXT_MIN_V	(3.0f*NUM_CELLS)// V. The minimal external load voltage
													// that must be present so that under-
													// voltage errors are ignored to
													// charge battery from under-
													// voltage condition
#define OPEN_LOOP_MIN_V_THRESHOLD	0.0				// V. OL_THR_MIN - Minimum voltage drop
													// threshold at which a open load error
													// will be detected for every cell
													// (user manual p54 suggests with
													// RF = 10Ohm default = 0.06V ->
													// 0x3 or 0 to turn off)
#define OPEN_LOOP_MAX_V_THRESHOLD	0.223			// V. OL_THR_MAX - Maximum voltage drop
													// threshold at which a open load error
													// will be detected for every cell
													// (user manual p54 suggests with
													// RF = 10Ohm default = 0.223V -> 0xB)
#define EXT_LOAD_VOLTAGE_THRESHOLD_V	17.000		// V. Threshold above which it
													// is assumed that there is already
													// a voltage supplying the output.
													// Note that at the current configuration
													// of the external ADC the lowest value
													// it can read is around 16V!
#define TLE9012_MAX_COM_ERRORS			15			// Number of common errors
													// (e.g. during conversion or other
													// commands) can happen before the error
													// ERR_EXT_TLE9012_COM_ERROR triggers
#define TLE9012_INTERVAL_COM_ERRORS		1000		// ms. Every TLE9012_INTERVAL_COM_ERRORS
													// ms the numComErrors_TLE9012 counter
													// will be reduced by 1.
													// This way errors cannot accumulate
													// over time but are time limited
#define DIRECT_SAVESTATE_ON_INTERRUPT	0			// Enables (0) or disables (1) the direct
													// activation of the save state pin
													// if error interrupts are received.
													// This will speed up the shutdown
													// from cycle time (~1ms) to instant
													// but may disrupt reset feature

// Error latching for analog front-end (Based on round robin time.
// This limits how fast the system tries restart after error.
// Can be counteracted by setting number of consecutive detected errors
// before error is valid in RR_ERR_CNT)
#define TLE9012_OVERTMP_ERR_LATCH_TIME	4000	// Time in ms that must pass before
												// int/ext overtemperature bits from TLE9012
												// inside the error_map will be cleared
												// (see diagnostic.c).
#define TLE9012_COMMON_ERR_LATCH_TIME	1000	// Time in ms that must pass before
												// all other error bits from TLE9012
												// inside the error_map will be cleared
												// (see diagnostic.c).

// ADC conversion external from MCP3465 (current and external load voltage measurement)
// Note that the actual setup of the ADC is done by changing
// the CONFIGx_CFG macros in MCO3x6x_ADC.h
#define ADC_V_MIN_PLAUSIBLE		17.000		// V. The minimum voltage of the external load
											// voltage measurement that can be considered
											// usable (depends e.g. on ADC settings)
#define ADC_V_RAW_CONVERSION	16.166667f*0.050354f 	// Conversion from raw data to
														// unit based on datasheet (i.e.
														// ((18200+1200)/1200)*(3300/65536))

#define ADC_V_EXT_CONST			868.4f		// Calibration constant for external voltage
#define ADC_V_EXT_P1			0.9721f		// Calibration coefficient for external voltage
#define ADC_I_RAW_CONVERSION	0.05035f	// Conversion from raw data to unit based on
											// datasheet (i.e. 3000/65536)
#define ADC_I_CONST				58.89f		// Calibration constant for current
#define ADC_I_P1				18.28f		// Calibration coefficient for current
#define ADC_EXT_ZEROING_NUM		16			// Number of times the external ADC value is read
											// (call of manage_external_ADC_MCP3465)
											// during init, used for filter startup and
											// zeroing of current. ADC_EXT_ZEROING_DELAY
											// must be set so that conversion can be
											// finished in this delay. Only every second call
											// will read channel 0 (current).
											// E.g.: 16 will read current 8 times ->
											// filter interval SYSTEM_FILTER_INTERVAL_I
											// must not be higher!
#define ADC_EXT_ZEROING_DELAY	10			// Delay in ms between each read of
											// external ADC during init
											// (see ADC_EXT_ZEROING_NUM description)

#define ADC_EXT_ZEROING_TIMEOUT_TIME	3000	// Time in ms that must pass before
												// a timeout during the zeroing of
												// external ADC is recognized
#define SYSTEM_DEFAULT_CURRENT_mA		25.0	// mA. Current that the default system
												// draws after startup with isolating
												// safety switch. Used to determine
												// setupBMS.MeasCalib_Offset_I
#define ADC_EXT_READ_TIMEOUT			3000	// Time in ms that must pass before
												// the communication with the ADC is
												// considered broken and a error flag
												// is set (diagnostic.c)
#define ADC_EXT_V_CHANGE_RATE_MAX		100.0	// V/ms. Values below this threshold
												// can be recognized as plausible.
												// The value is set to this if
												// change rate can not be calculated
												// (first/ error read value)

