Infineon/IMR_PSoC6_BMS/proj_cm4/Libraries/BMS_Functionalities/global_management.h
// ADC conversion internal (rough current measurement with 2ED4820 CSO)
#define ADC_I_DRIVER_CONV_P0	-276820.05032114195637
#define ADC_I_DRIVER_CONV_P1	281.68833898924356
#define ADC_I_DRIVER_CONV_P2	-0.06922250940858

// Filter
#define SYSTEM_FILTER_INTERVAL_IMBALANCE 3	// Number of values over which the cell imbalance
											// is averaged. The filter time is depending on
											// the frequency of measure_movAvgFilter_fast()
											// execution. At 5ms, a value of 10 means
											// the value is filtered over 50ms
#define SYSTEM_FILTER_INTERVAL_I 		 5	// Number of raw values over which the system
											// current is averaged. The filter time is
											// depending on the measurement frequency.
											// At 5ms, a value of 10 means the value is
											// filtered over 50ms. ADC_EXT_ZEROING_NUM
											// must not be lower than this
#define SYSTEM_FILTER_INTERVAL_V 		 1	// Number of raw values over which the system
											// voltage is averaged. The filter time is
											// depending on the measurement frequency.
											// At 5ms, a value of 10 means the value is
											// filtered over 50ms
#define SYSTEM_FILTER_INTERVAL_TEMPCELL	 15	// Number of raw values over which the system
											// average cell temperature is averaged.
											// The filter time is depending on
											// the measurement frequency. At 5ms,
											// a value of 10 means the value is filtered
											// over 50ms

// Battery state
#define BATTERY_LOW_WARNING_SOC			20		// SoC in percent below which the red LED
												// starts flashing to signal to recommend
												// battery change
#define BATTERY_LOW_WARNING_DELAY_TIME	1000	// Time in ms during which the SOC must be
												// below the SOC Threshold before system is
												// signaling the user to change battery
#define ETA_C 							0.97f	// Percent/100.
												// SoC/SoH battery charge efficiency
#define ETA_D  							0.998f	// Percent/100.
												// SoC/SoH battery discharge efficiency
#define BATTERY_STATE_MINMAX_TOL        0.2f	// in V. Tolerance of how far below/above
												// the cell is still recognized as
												// completely empty/full 0%/100%
												// (see battery_state.c)
#define BATTERY_RATED_CAPACITY	(3.45*1.0*3600.0)	//	Rated Capacity in As, of each
													// series cell => 2.6Ah per cell *
													// 1 cells parallel * 3600 to get As
#define REMAINING_RUNTIME_SOC_PERCENT	0.10		// in % 0.00 to 1.00. The SOC where the
													// battery is expected to be empty
													// (cannot supply enough current for
													// expected load). The remaining battery
													// runtime is calculated for the point
													// where the SOC is expected to go
													// below this value.
#define SOC_UPPER_TH_USE_LAST_VALUE		4.10	// in V. Cell voltage above which the last
												// stored SoC value is used (not the value
												// from the OCV curve). To deactivate this
												// feature set the value above maximal
												// cell voltage
#define SOC_LOWER_TH_USE_LAST_VALUE		3.00	// in V. Cell voltage below which the last
												// stored SoC value is used (not the value
												// from the OCV curve). To deactivate this
												// feature set the value below minimal
												// cell voltage
#define SOC_LAST_TO_OCV_MAX_DIFF		7.00	// in %. At initialization of the SoC,
												// this is the maximum difference between
												// the stored and OCV evaluated SoC at which
												// the stored value can still be used
												// (useful e.g. if BMS was switched off
												// with full/empty battery and then
												// subjected to cell changes)
#define SOH_INIT 						100  	// in %. Initial SoH set when
												// it was never stored
#define BATTERY_SOH_CAPACITY_RANGE		4900	// in As. Amount of capacity that should
												// change between SOH_UPPER_THRESHOLD and
												// SOH_LOWER_THRESHOLD voltage to get
												// 100% SoH (If zero it will be estimated
												// from OCV curve. Write correct value
												// after first estimation with expected
												// current here)
#define SOH_LOWER_THRESHOLD	   			20		// in %. The SoC threshold at which the
												// SoH calculation is started
												// (charge counting between lower and
												// upper threshold). Determined by
												// conversion of the threshold percent
												// to V with OCV curve and compared to
												// average cell voltage
#define SOH_UPPER_THRESHOLD	   			90		// in %. The SoC threshold at which the
												// SoH calculation is finalized
												// (charge counting between lower and
												// upper threshold). Determined by
												// conversion of the threshold percent
												// to V with OCV curve and compared to
												// average cell voltage
#define SOH_INITIAL_CURRENT	   			1.5		// in A. The minimal current that must be
												// present for SoH estimation cycle to start
#define SOH_MAX_TEMPERATURE	   			50.5	// in C. The maximal temperature that is
												// allowed for the SoH estimation to be
												// usable (BATTERY_SOH_CAPACITY_RANGE
												// changes with temperature).
												// If temperature is too high the SoH will be
												// calculated but not used
#define SOH_MIN_TEMPERATURE	   			20.5	// in C. The minimal temperature that is
												// allowed for the SoH estimation to be
												// usable (BATTERY_SOH_CAPACITY_RANGE
												// changes with temperature).
												// If temperature is too low the SoH will be
												// calculated but not used

// Balancing
#define BALANCING_MIN_MAX_THRESHOLD 	30		// mV. If the cell with the minimum
												// cell voltage and that with the maximum
												// cell voltage is further than this vale
												// apart balancing is (generally) activated
#define BALANCING_CELL_TH_LIMIT			10		// mV. The balancing algorithm calculates and
												// sends the level of the lowest cell to each
												// cell as "BalVolt" (balancing threshold).
												//If the cell recognizes its own voltage
												// to be more than BALANCING_CELL_TH_LIMIT
												// over the "BalVolt" it starts balancing.
#define BALANCING_DEACTIVATED_VALUE 	10000	// Fixed value to which the balancing
												// threshold will be set in order to
												// signal that balancing is deactivated

// Debug
#define ENABLE_DEBUG
#define SOC_FAKE_MAP_0_PERCENT_mV		(2800.0*NUM_CELLS)
#define SOC_FAKE_MAP_100_PERCENT_mV		(4200.0*NUM_CELLS)

// Unused
/*
#define BATTERY_CRITICAL_TAKEOVER_SOC	15		// SoC in % below which the system tries to
												// give over to a second BMS
#define CURRENT_CSO_DISBLED_THRESHOLD	10		// Raw ADC values below which the CSO is
												// determined disabled (the driver deactivates
												// the CSO on some errors and at that point
												// it does not give out 0A in terms of
												// raw ~2048 (half of rev. voltage) but
												// drops to 0 which would be interpreted
												// as max charge current)
#define IDLE_CURRENT_THRESHOLD		0.150		// mA. Current around 0A that is considered
												// idle (not considered charge or discharge)
#define HOLD_ZERO_CURRENT_THRESHOLD 	0.02	// mA. Current around 0A that is considered
												// zero (prevents flickering in GUI)
#define PUSH_PC_DATA_REFRESH_TIME   	500		// Time in ms between each refresh of high
												// priority data to the PC (Dashboard etc)
#define PUSH_PC_SETTINGS_REFRESH_TIME	6000	// Time in ms between each refresh of low
												// priority data to the PC
*/

// Simple function to report a failed TLE9012 function execution via debug UART:
// Example -TLE9012_DETECT_COM_ERROR(tle9012_convertBlockVoltage(1, 1),
//									 convertBlockVoltage_error);
// FUNCTION_WITH_PARAMETERS - The function to be executed with parameters
// STRING                   - The string that shall be added to debug message
// 							  (there might be no spaces allowed)
extern requestResult tle9012_print_if_error_result;
#define SUCCESS_FUNCTION_NONE (void)0;
#define TLE9012_DETECT_COM_ERROR(FUNCTION_WITH_PARAMETERS, STRING, SUCCESS_COMMAND) { \
		tle9012_print_if_error_result = FUNCTION_WITH_PARAMETERS; \
	if(tle9012_print_if_error_result >= REQUEST_ERROR){ \
		DEBUGPRINTF("[ERROR]: " #STRING " returned %d\r\n", tle9012_print_if_error_result); \
		numComErrors_TLE9012++; \
	}                       	\
	else{                   	\
		SUCCESS_COMMAND;    	\
	}                       	\
}


//****************************************************************************
//           ENUMS AND OBJECT DEFINITION
//****************************************************************************
typedef enum {
	ACTION_OK,
	ACTION_FAIL,
	ACTION_WAITING
} action_status;

