Infineon/IMR_PSoC6_BMS/proj_cm4/Libraries/BMS_Functionalities/global_management.h
/// STATE MACHINES
// Represents the current state of the system it self.
// State BMS_CHARGING and BMS_DISCHARGING are considered normal operation.
typedef enum {
	BMS_CHARGING = 5,
	BMS_DISCHARGING = 6,
	BMS_IDLE = 7,
	BMS_ERROR = 10
} bms_states;

// State of measurement
typedef enum {
	MEASUREMENT_WAIT_RESULT = 0U,
	MEASUREMENT_READ_RESULT = 1U,
	MEASUREMENT_TRIGGER_NEXT = 2U
} measurementStates;

// State of the safety switch
typedef enum {
	SWITCH_IDLE,
	SWITCH_PRECHARGE
} switchStates;

// HotSwap roles determined by circumstances
typedef enum {
	HOTSWAP_MAIN,
	HOTSWAP_TAKER,
	HOTSWAP_GIVER,
	HOTSWAP_ERROR
} hotSwapRoles;

// HotSwap state machines of different roles
typedef enum {
	TAKER_WAIT_FOR_HANDSHAKE,
	TAKER_WAIT_SWAP,
	TAKER_WAIT_FINISH
} takerHotSwapStates;
typedef enum {
	GIVER_SEND_HANDSHAKE,
	GIVER_WAIT_FOR_HANDSHAKE,
	GIVER_WAIT_REDUCE_POWER,
	GIVER_WAIT_SWAP
} giverHotSwapStates;

// BMS status data send via CAN states
typedef enum {
	CAN_DATA_SEND_SOC,
	CAN_DATA_SEND_VOLTAGE,
	CAN_DATA_SEND_CURRENT
} canDataSendStates;

// External ADC active channel
typedef enum {
	ACTIVE_EXT_ADC_CH0_CURRENT,
	ACTIVE_EXT_ADC_CH1_LOAD_VOLTAGE,
	ACTIVE_EXT_ADC_WAIT_FOR_CURRENT_TRIGGER
} activeChannelExternelADCStates;

// Unused
/*
typedef enum {
	TAKEOVER_NONE,
	TAKEOVER_SHUTDOWN_PRESSED,
	TAKEOVER_SOC_CRITICAL
} takeoverStates; */


/// MAIN STRUCT
typedef struct {
	uint8_t returnValue;
	bms_states bms_state;
	volatile float current;
	volatile float voltage;
	float avgTemp;			// Average cell temperature
	float SoC;
	float SoH;
	uint32_t error_map;		// Current error map
							// (for latched version see latched_error_map)
	uint32_t message_map;	// Current warning and message map
							// (for latched version see latched_message_map)
	uint16_t ol_map;		// Open load map (latched till external communication)
	uint16_t uv_map;		// Under-voltage map (latched till external communication)
	uint16_t ov_map;		// Over-voltage map (latched till external communication)
	uint16_t bal_uc_map;	// Balancing under current map
							// (latched till external communication)
	uint16_t bal_oc_map;	// Balancing over current map
							// (latched till external communication)
	uint16_t imbalance;		// Difference between the highest and lowest cell voltage
							// (refreshed only during balancing)
	uint16_t avgCellVolt_mV;
	uint16_t bal_cell_map;
	measurementStates measurementState;
	switchStates switchState;
	outputStates outputState;
	slotStates slotState;
	float extLoadVoltage;
	hotSwapRoles hotSwapRole;
	giverHotSwapStates giverHotSwapState;
	takerHotSwapStates takerHotSwapState;
	float voltageChangeRate_ms;
} statusBMS_struct;
extern volatile statusBMS_struct statusBMS;

/// Latched bitmaps
// Used to latch errors between switch ON of the safety switch.
// Will be reset if switchState is SWITCH_IDLE and switch on conditions are met
// (if an error happens which causes the switch to shut of it might be gone afterwards.
// This retains the information until the system can switch on again)
extern uint32_t latched_error_map_switch_on;
// Used to latch errors between PC/CAN transmissions.
// Will be reset at every call of manageExternalCommunicationBMS
// (if an error happens only once during loops where there is no
// CAN/PC transmission it would otherwise not be detected)
extern uint32_t latched_error_map_ext_com;
// Used to latch warnings and messages between PC/CAN transmissions
// (if an error happens only once during loops where there is no CAN/PC transmission
// it would otherwise not be detected)
extern uint32_t latched_message_map;

/// SoC and SoH management
extern battery_state_struct batteryState;

// Setup
typedef struct{
	uint16_t NumCells;
	uint8_t  CellPackID[4];
	int16_t  MeasCalib_Offset_I;	// Offset of used for current calculation
	uint16_t LimitUnderVoltage;
	uint16_t LimitOverVoltage;
	uint16_t LimitUnderVoltageCell;
	uint16_t LimitOverVoltageCell;
	uint16_t BalVolt;
	uint16_t BalLimit;
	uint16_t BatteryRatedCapacity;
} setupBMS_struct;
extern volatile setupBMS_struct setupBMS;


//****************************************************************************
//           VARIABLES
//****************************************************************************
// Interrupt variables
// Safety switch driver error interrupt detection
extern volatile uint8_t errorInterruptDetected_2ED4820;
// BMS analog front end error interrupt detection
extern volatile uint8_t errorInterruptDetected_TLE9012;

/// Timestamps for time interval control
// Slot detection
extern uint32_t slotPlugDebounceTimestamp;
// Memory
extern uint32_t memorySystemDataRefreshTimestamp;
extern uint32_t memoryRtDataRefreshTimestamp;
extern uint32_t memoryRtDataRefreshTime;
extern uint8_t  memoryRtDataRefresh_isTimeFixed;
// Safety switch
extern uint32_t switchPrechargeStartTimestamp;
// Time stamp when the switch where last tried to switch conducting
extern uint32_t lastSwitchOnTimestamp;
extern uint8_t safety_switch_retry_counter;
// Main loop intervals
// Time stamp when the communication from and to the BMS was last managed
extern uint32_t lastExternalCommunicationTimestamp;
// Time stamp when the battery state was last calculated
extern uint32_t lastBatterySateCalcTimestamp;
extern uint32_t canLastMessageTimestamp;
extern uint32_t canSwitchOnVetoRefreshTimestamp;
extern uint32_t canDataRefreshTimestamp;
extern uint32_t shutdownTriggeredTimestamp;
extern uint32_t batteryLowWarningTimestamp;
extern uint32_t updatePublicDisplayDataTimestamp;
// Analog front-end TLE9012
// Time stamp when the measurement on the TLE9012 was last triggered
extern uint32_t lastTLE9012MeasurementTimestamp;
// Time stamp when numComErrors_TLE9012 was last reduced by 1
// See description of TLE9012_MAX_COM_ERRORS
extern uint32_t lastTLE9012IntervalComErrorReduceTimestamp;
// LED blink
extern uint16_t blinkTimeLedOrange;
extern uint32_t blinkTimeLedRedTimestamp;
// Hotswap
extern uint32_t giverHotSwapTimestamp;
extern uint32_t takerHotSwapTimestamp;
extern uint32_t switchOnVetoTimestamp;
// ADC
extern uint32_t adcZeroingTimestamp;
extern uint32_t adcExtLastReadSuccessTimestamp;
extern uint32_t adcLastVoltageChangeRateTimestamp;
// Deep discharge protection
extern uint32_t deepDischargeTimestamp;

// Flags
extern uint8_t isCurrentOffsetCalibrating;
extern uint8_t isShutdownTriggered;
extern uint8_t isTLE9012ResultReceivedThisCycle;
extern uint8_t TriggerCurrentMeasurement;

/// TLE9012 errors
extern uint16_t numComErrors_TLE9012;
extern QueueResult lastQueueResult_tle9012;

/// Watchdog
extern uint32_t mainLoopCounter;
extern uint32_t mainLoopCounter_lastWatchdog;
extern uint8_t isWatchdogActive;
/// ADC
// External ADC
// Currently checked channel of external ADC MCP3465 (default off)
extern activeChannelExternelADCStates activeChannelExternalADC;
extern float lastExtVoltageMeasurement;
// Internal ADC (coding resistor and low resolution current measurement)
extern int32_t adc_coding_res_mV;
extern int32_t adc_safety_switch_current_mV;
extern int32_t adc_safety_switch_current;

// RT data recording
// THIS IS ONLY UPDATED AFTER EACH CURRENT MEASUREMENT
//(TRIGGERED BY ANALOG FRONTEND MEASUREMENT)!
//If rt data is recorded faster than measurement this might be 0
extern uint32_t rt_data_time_since_last_record;
// THIS IS ONLY UPDATED AFTER EACH CURRENT MEASUREMENT
// (TRIGGERED BY ANALOG FRONTEND MEASUREMENT)!
// If rt data is recorded faster than measurement this might be 0
extern float rt_data_charge_since_last_record;
extern float rt_Data_dC_lostDecimals;

/// FILTER
typedef struct {
    uint16_t  bufIdx;	// Index of current value in buffers
    int32_t  lastIdx;	// Index of the oldest value in filter interval (will be erased)
    uint16_t  bufMaxIdx;// Maximum index of all buffers
    int32_t* bufRaw;	// The raw value buffer
    float     filterResult;         // The filtered value
    float     avgFilterSum;         // Sum of all values in filter interval (moving)
    uint16_t  avgFilterInterval;    // Size of the filter interval
    int32_t   initFilterCompesation;// Variable used at the beginning so that the divider
    								// is ramped up as values are added to the sum
} avgFilter;
extern volatile avgFilter avgFilter_I;
extern volatile avgFilter avgFilter_V;
extern volatile avgFilter avgFilter_Imbalance;
extern volatile avgFilter avgFilter_tempCell;


//****************************************************************************
//           FUNCTION PROTOTYPES
//****************************************************************************
void measure_movAvgFilter_fast(volatile avgFilter* filter, int32_t newValue);
void measure_movAvgFilter_clean(volatile avgFilter* filter, int32_t newValue);


float mapRangeToScale(float n, float lRange, float hRange, float scale);
void printBinary(uint32_t data, uint32_t mask, uint8 sizeBits);
float polyEvalLinear(float acd_reading);

#endif /* GLOBAL_MANAGEMENT_H_ */
